src/AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ТоварыНаСкладах/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает остатки по списку **Номенклатуры** из регистра **ТоварыНаСкладах**
// Параметры:
//  списокНоменклатуры - ФиксированныйМассив, Массив из СправочникСсылка.Номенклатура
//  период - Дата, МоментВремени, Граница, Неопределено
//  параметры - ФиксированнаяСтруктура, Структура
//              * Выгрузить - Булево - По умолчанию = Истина
//              * ТолькоОтрицательныеОстатки - Булево - По умолчанию = Ложь
//            - Неопределено
// Возвращаемое значение:
//  - ТаблицаЗначений - Если **выгрузить** = Истина
//  - ВыборкаИзРезультатаЗапроса - Если **выгрузить** = Ложь
//      * Номенклатура - СправочникСсылка.Номенклатура
//      * Склад - СправочникСсылка.Склады
//      * СрокГодности - Дата
//      * Количество - Число
//      * Сумма - Число
//  - Неопределено - Если данные отсутствуют в регистре
Функция ПолучитьОстаткиНоменклатуры(Знач списокНоменклатуры, Знач период = Неопределено, Знач параметры = Неопределено) Экспорт
    ДиагностикаКлиентСервер.Утверждение(ПроверкаТиповКлиентСервер.ЭтоМассив(списокНоменклатуры, Ложь),
        "Список номенклатуры должен иметь Тип ""[Фиксированный]Массив"".");
    ДиагностикаКлиентСервер.Утверждение(параметры = Неопределено ИЛИ ПроверкаТиповКлиентСервер.ЭтоСтруктура(параметры, Ложь),
            "Аргумент ""Параметры"" должен иметь тип ""[Фиксированная]Структура"".");

    параметры = ?(параметры = Неопределено,
            Новый Структура("Выгрузить, ТолькоОтрицательныеОстатки", Истина, Ложь),
            параметры);

    выгрузить = РаботаСКоллекциямиКлиентСервер.ПолучитьЗначениеСтруктуры(
            параметры, "Выгрузить", Истина);
    толькоОтрицательныеОстатки = РаботаСКоллекциямиКлиентСервер.ПолучитьЗначениеСтруктуры(
            параметры, "ТолькоОтрицательныеОстатки", Ложь);

    запрос = Новый Запрос;
    запрос.УстановитьПараметр("Номенклатура", списокНоменклатуры);
    запрос.Текст =
        "ВЫБРАТЬ
        |	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
        |	ТоварыНаСкладахОстатки.Склад КАК Склад,
        |	ТоварыНаСкладахОстатки.СрокГодности КАК СрокГодности,
        |	ТоварыНаСкладахОстатки.КоличествоОстаток КАК Количество,
        |	ТоварыНаСкладахОстатки.СуммаОстаток КАК Сумма
        |ИЗ
        |	РегистрНакопления.ТоварыНаСкладах.Остатки(&Период, Номенклатура В (&Номенклатура)) КАК ТоварыНаСкладахОстатки
        |ГДЕ &Условие
        |";

    Если период = Неопределено Тогда
        запрос.Текст = СтрЗаменить(запрос.Текст, "&Период, ", "");
    Иначе
        запрос.УстановитьПараметр("Период", период);
    КонецЕсли;

    Если толькоОтрицательныеОстатки Тогда
        запрос.Текст = СтрЗаменить(запрос.Текст, "&Условие", "ТоварыНаСкладахОстатки.КоличествоОстаток < 0");
    Иначе
        запрос.Текст = СтрЗаменить(запрос.Текст, "ГДЕ &Условие", "");
    КонецЕсли;

    результатЗапроса = запрос.Выполнить();
    Если результатЗапроса.Пустой() Тогда
        Возврат Неопределено;
    КонецЕсли;

    Если выгрузить = Истина Тогда
        Возврат результатЗапроса.Выгрузить();
    Иначе
        Возврат результатЗапроса.Выбрать();
    КонецЕсли;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
